PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
/**
 * @file adc_eTimerClockedAdc.c
 * Driver for analog-to-digital conversions with the MPC5643L.\n
 *   Naive, software controlled regular sampling of an analog input cannot guarantee the
 * correct sampling time; SW control can only ensure the correct mean value of the timing
 * but the particular sampling times undergo a jitter. Such a jitter means a sampling
 * error, which increases in first order with the frequency of the input information.
 * Reliable sampling requires triggering the sampling times by a hardware timer without SW
 * interaction.\n
 *   For the MPC5643L, the ADC can be triggered from different I/O devices. The trigger
 * clock is routed from these devices to the ADC by the CTU. This ADC driver configures
 * four devices:\n
 *   - It uses one channel of one of the two Enhanced Motor Control Timer modules
 *     eTimer_0 or eTimer_1 (module eTimer_2 is not connected to the CTU)\n
 *   - The CTU is configured to command the ADCs to do the sampling. It has the eTimer
 *     module as input\n
 *   - The two ADCs are identical configured such that they wait for the CTU commands and
 *     do the conversions\n
 *   The ADC conversion results are written into a global array of values, which serves as
 * API of the module. The array is updated after each conversion cycle. The application
 * code can be notified by callback about the availability of a new result. This supports
 * synchronous processing of the sampled analog input signal.\n
 *   The external inputs to the ADCs are not configured by this driver. The programming of
 * the SIUL to route the MCU pins to the ADC inputs needs to be done by the client code
 * prior to starting the conversions with adc_startConversions().\n
 *   The set of channels, which is converted in every cycle is statically configured at
 * compile time. It is not possible to define or change this set at run-time. Moreover, it
 * is not possible to sample different channels at different rates. The conversion cycle is
 * defined (set of channels, cycle time and settings for a single conversion) and this
 * cycle is repeated all time long. The configuration is done with preprocessor macros,
 * mainly found in the header file adc_eTimerClockedAdc.h.\n
 *   The internal signals (TSENS_0 and TSENS_1) and VREG_1.2V can be configured for
 * conversion as any other channel, however this has specific side effects:\n
 *   - If and only if the temperature signals TSENS_0 and TSENS_1, channels 15, ADC_0 and
 *     ADC_1, respectively, are element of the set of converted channels then there are
 *     APIs to read the temperature signals in degree centigrade\n
 *   - If the reference voltage VREG_1.2V, channels 10, ADC_0 and ADC_1, respectively, are
 *     element of the set of converted channels then the averaged measured reference
 *     voltage is used to calibrate all the other channels in Volt\n
 *   @remark
 * Some configuration items of the driver are hard-coded and not modeled as compile-time
 * #define's. Depending on the application, these settings and thus the implementation of
 * the driver can become subject to modifications. A prominent example is the conversion
 * timing. The related settings are chosen for a rather slow sampling rate but better
 * accuracy; a rate of a few kilohertz is targeted. Higher rates may require another
 * timing configuration and much higher rates could even require structural code changes,
 * like DMA support.
 *   @remark
 * The configuration settings depend on one another. There are several constraints like: A
 * very short cycle time is impossible if the number of active channels is large. Because
 * we use preprocessor macros for configuration most of the constraints can be checked at
 * compile time using preprocessor conditions and the _Static_assert keyword. Therefore,
 * there are barely run-time errors recognized and reported by the code. A bad
 * configuration will simply not compile.
 *   @remark
 * More documentation about this ADC driver for MPC5643L can be found at
 * https://github.com/PeterVranken/TRK-USB-MPC5643L/tree/master/LSM/ADC.
 *
 * Copyright (C) 2017-2018 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   adc_initDriver
 *   adc_startConversions
 *   adc_getChannelAge
 *   adc_getChannelRawValue
 *   adc_getChannelVoltage
 *   adc_getChannelVoltageAndAge
 *   adc_getTsens0
 *   adc_getTsens1
 * Local functions
 *   initETimer
 *   initCTU
 *   compileAdcCommandList
 *   initADC
 *   isrAdcAllConversionsDone
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdatomic.h>
#include <stdlib.h>
#include <stdio.h>
#include <limits.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "ihw_initMcuCoreHW.h"
#include "rcc_readCalibrationConstants.h"
#include "adc_eTimerClockedAdc.h"
#include "adc_eTimerClockedAdc.inc"


/*
 * Defines
 */

/** The CTU is connected to channel 2 of the timer modules 0 and 1. The module to use can
    be selected. Either state ETIMER_0 or ETIMER_1. */
#define ETIMER  (ETIMER_1)

/** The channel of the eTimer module is fixed to 2; the CTU is not connected to the outputs
    of the other counters in a timer module. Do not change this macro. */
#define TIMER_CHN   (2)

/** For development and debug purpose, the output of eTimer_1, which can be used to trigger
    the ADC conversion, can be routed to a MCU pin, which is port D[1] (pin number depends
    on package). For the TRK-USB-MPC5643L, this pin is connected to connector J1A, A60.
      @remark This setting has no effect in PRODUCTION compilation. In production
    compilation the pin is always disabled.
      @remark If module eTimer_0 is used (see #ETIMER) then no pin is available, which can
    reasonably be used with board TRK-USB-MPC5643L and this macro needs to be configured 0. */
#define ENABLE_OUTPUT_OF_ETIMER_CHN2    1

/** For development and debug purpose, the trigger output of the CTU can be routed to a MCU
    pin, which is port C[14] (pin number depends on package). For the TRK-USB-MPC5643L,
    this pin is connected to connector J1A, B22.
      @remark This setting has no effect in PRODUCTION compilation. In production
    compilation the pin is always disabled. */
#define ENABLE_OUTPUT_OF_CTU_TRIGGER    1

/** The peripheral clock rate as configured in the startup code. Unit is Hz and value is an
    unsigned long literal. Do not change. */
#define PERIPHERAL_CLOCK_RATE   (120000000ul)

/** The value of the reference range bit in the ADC registers MCR and MSR. The value depends
   on the configured reference voltage. Here for ADC_0. Do not change the definition. */
#define ADC_0_BIT_REF_RANGE ((ADC_ADC_0_REF_VOLTAGE >= (3.6f + 4.5f)/2.0f)? 0x80000u: 0x0u)

/** The value of the reference range bit in the ADC registers MCR and MSR. The value depends
    on the configured reference voltage. Here for ADC_1. Do not change the definition. */
#define ADC_1_BIT_REF_RANGE ((ADC_ADC_1_REF_VOLTAGE >= (3.6f + 4.5f)/2.0f)? 0x80000u: 0x0u)


