PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
/*
 * Local type definitions
 */


/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** This callback is invoked from the end-of-conversion interrupt after each CTU cycle and
    after fetching the conversion results from the ADCs. */
static void (*_cbEndOfConversion)(void) = NULL;

/** Diagnosis: The number of ever failed conversion cycles since startup. A failed cycle is
    one, where at least one conversion result was not properly available. */
static unsigned int _noFailedConversions = 0;

/** Diagnosis: The number of conversion cycles since the last successful cycle. Normally
    zero. */
static unsigned short _ageOfConversionResults = USHRT_MAX;

/** The conversion results of both ADCs. ADC_0 comes first, followed by the results of
    ADC_1. */
static uint16_t _conversionResAry[ADC_NO_ACTIVE_CHNS] = {[0 ... ADC_NO_ACTIVE_CHNS-1] = 0};

#if ADC_USE_ADC_0_CHANNEL_10 == 1
/** The averaged and scaled reading of channel 10, ADC_0, which is internally connected to
    signal VREG_1.2V. */
static float _adc0_chn10 = 65536.0f / ADC_ADC_0_REF_VOLTAGE;
#endif

#if ADC_USE_ADC_1_CHANNEL_10 == 1
/** The averaged and scaled reading of channel 10, ADC_1, which is internally connected to
    signal VREG_1.2V. */
static float _adc1_chn10 = 65536.0f / ADC_ADC_1_REF_VOLTAGE;
#endif

/** The TSENS input, chn 15, requires alternating voltage measurement in two sensor modes,
    linear and inverse to lower errors and to make the measurement independent of the
    reference voltage. After each measurement we toggle the mode. Variable _TSENSOR_SEL
    holds the currently used mode. */
#if ADC_USE_ADC_0_CHANNEL_15 == 1  ||  ADC_USE_ADC_1_CHANNEL_15 == 1
static unsigned int _TSENSOR_SEL = 0;
#endif

#if ADC_USE_ADC_0_CHANNEL_15 == 1
/** The averaged two TSENS_0 readings. The initial values are chosen such that the
    computation starts with a value of about 30 degrees centigrade (the actual value is
    significantly device dependent). */
static float _TSENS_0[2] = {[0] = 32500.0f, [1] = 31000.0f};
#endif

#if ADC_USE_ADC_1_CHANNEL_15 == 1
/** The averaged two TSENS_1 readings. The initial values are chosen such that the
    computation starts with a value of about 30 degrees centigrade (the actual value is
    significantly device dependent). */
static float _TSENS_1[2] = {[0] = 32500.0f, [1] = 31000.0f};
#endif

/* Some constants from the device individual test and calibration data, required later for
   the computation of the chip temperature. */
#if ADC_USE_ADC_0_CHANNEL_15 == 1
static float TSENS_0_P1 = 1.0f
           , TSENS_0_P2 = 0.0f
           , TSENS_0_C1 = 1.0f
           , TSENS_0_C2 = 0.0f;
#endif
#if ADC_USE_ADC_1_CHANNEL_15 == 1
static float TSENS_1_P1 = 1.0f
           , TSENS_1_P2 = 0.0f
           , TSENS_1_C1 = 1.0f
           , TSENS_1_C2 = 0.0f;
#endif
#if ADC_USE_ADC_0_CHANNEL_15 == 1  ||  ADC_USE_ADC_1_CHANNEL_15 == 1
# define TSENS_T2   (-40)
# define TSENS_T1   (150)
#endif


/*
 * Function implementation
 */

/**
 * Initialize the common part of the eTimer module and its counter channel 2.\n
 *   Which eTimer module to use is configured by #ETIMER at compile time.\n
 *   The cycle time is configured as #ADC_T_CYCLE_IN_US at compile time.\n
 *   The timer is not yet started. Later use startETimer() to do so.
 */
static void initETimer()
{
    /* The macros down here implicitly assumes a particular clock rate. The boundaries for
       the selection of the prescaler need adaptation for another clock rate. */
    #if PERIPHERAL_CLOCK_RATE != 120000000l
    # error The configuration of the eTimer is based on a fixed clock rate of 120 MHz
    #endif

    /* Which prescaler do we need to implement the wanted cycle time? The lower boundary of
       10us is weak and a bit arbitrary. It will work only if the client code demands only
       a single conversion per cycle and if the data evaluation is very fast. */
    #if ADC_T_CYCLE_IN_US < 10
    # define DIV_AS_PWR_OF_2 0
    # error Cycle time ADC_T_CYCLE_IN_US is configured too little. Values below 10us are \
            not supported
    #elif ADC_T_CYCLE_IN_US <= 1092
    # define DIV_AS_PWR_OF_2 0
    #elif ADC_T_CYCLE_IN_US <= 2184
    # define DIV_AS_PWR_OF_2 1
    #elif ADC_T_CYCLE_IN_US <= 4368
    # define DIV_AS_PWR_OF_2 2
    #elif ADC_T_CYCLE_IN_US <= 8737
    # define DIV_AS_PWR_OF_2 3
    #elif ADC_T_CYCLE_IN_US <= 17475
    # define DIV_AS_PWR_OF_2 4
    #elif ADC_T_CYCLE_IN_US <= 34951
    # define DIV_AS_PWR_OF_2 5
    #elif ADC_T_CYCLE_IN_US <= 69903
    # define DIV_AS_PWR_OF_2 6
    #elif ADC_T_CYCLE_IN_US <= 139807
    # define DIV_AS_PWR_OF_2 7
    #else
    # define DIV_AS_PWR_OF_2 7
    # error Cycle time ADC_T_CYCLE_IN_US is configured too large. Values above 139ms are \
            not supported
    #endif

#if ENABLE_OUTPUT_OF_ETIMER_CHN2 == 1  &&  defined(DEBUG)
    /* Note, this setting is useful for testing but correct only if the macros select
       counter/channel 2 of eTimer 1.
         SMC, 0x4000: Output enable in SoC safe mode
         APC, 0x2000: Enable as analog input
         PA, 0x0c00: 0: GPIO (ALT0), otherwise index of alternate mode, eTimer1, T5 is ALT2
         OBE, 0x0200: Output buffer enable for GPIO mode
         IBE, 0x0100: Input buffer enable
         ODE, 0x0020: 1: Open drain enable, 0: Push/pull driver
         SRC, 0x0004: Slew rate, 0: slow, 1: fast
         WPE, 0x0002: Enable pull up or down
         WPS, 0x0001: 1: pull up, 0: pull down (if enabled with WPE) */
    _Static_assert( &ETIMER.CHANNEL[TIMER_CHN] == &ETIMER_1.CHANNEL[2]
                  , "SIUL configuration for output of eTimer is available only for device"
                    " eTimer_1, channel 2"
                  );
    SIU.PCR[49].R = 0x0800; /* D[1] pin configured as Timer_1, external counter output 2. */
#endif

#define COUNTER (ETIMER.CHANNEL[TIMER_CHN])

    /* All timers are enabled by default and start operation as soon as CTRL1.CNTMODE is
       set. We inhibit this early start. */
    ETIMER.ENBL.R &= ~(1<<TIMER_CHN);

    /* Control register CTRL1:
         CNTMODE, 0xe000: 1 means count rising edges
         PRISRC, 0x1f00, count source: 0x3bbb means peripheral clock divided by 2^0xbbb
         SECSRC, 0x0014, secondary source: not applied */
    COUNTER.CTRL1.B.CNTMODE = 1;
    COUNTER.CTRL1.B.PRISRC = 0x18 + DIV_AS_PWR_OF_2; /* Clock by 8=2^3 */
    COUNTER.CTRL1.B.ONCE = 0; /* Count continuously. */
    COUNTER.CTRL1.B.LENGTH = 1; /* Control period by compare register. Reload from register
                                   LOAD. */
    COUNTER.CTRL1.B.DIR = 1; /* 0: upwards, 1: downwards */
    COUNTER.CTRL1.B.SECSRC = 0; /* default, not applied */

    COUNTER.CTRL2.B.OEN = 1; /* Enable output, is used to trigger CTU. */
    COUNTER.CTRL2.B.COINIT = 0; /* The channel works independently of the others. */
    COUNTER.CTRL2.B.MSTR = 0; /* The channel works independently of the others. */
    COUNTER.CTRL2.B.OUTMODE = 3; /* Toggle output on comp1 or comp2, whatever comes first. */

    COUNTER.CTRL3.B.STPEN = 0; /* Output is still valid when stopped. */
    COUNTER.CTRL3.B.ROC = 0; /* We don't use the capturing mechanism and don't reload the
                                compare registers. */
    COUNTER.CTRL3.B.DBGEN = 1; /* Halt counter in debug mode. */

    /* All counter value capturing under control of the secondary input is disabled.
         CMPMODE, 0x0300: Compare registers are connected to count directions. We only use
       comp1 on counting down. */
    COUNTER.CCCTRL.R = 0x0100;

    /* The period of the output signal is configured.
         +1: Because of the output toggle mode the period is twice the counter cycle time.
         The compare registers are set such that they don't affect the timing. COMP1
       triggers the reload at counter value 0 and comp2 never matches at all. */
    #define T_CYCLE_REGVAL(type)                                                            \
                ((type)(0.5 + ((float)PERIPHERAL_CLOCK_RATE / (1u<<(DIV_AS_PWR_OF_2+1)))    \
                              * ((float)ADC_T_CYCLE_IN_US/1e6)                              \
                       )                                                                    \
                 - 1                                                                        \
                )
    _Static_assert( T_CYCLE_REGVAL(int64_t) > 0  &&  T_CYCLE_REGVAL(int64_t) <= 65535
                  , "Cycle time out of range"
                  );
    COUNTER.LOAD.R = T_CYCLE_REGVAL(uint16_t);
    COUNTER.COMP1.R = 0;
    COUNTER.COMP2.R = 0xffff;
    #undef T_CYCLE_REGVAL

    /* Initialize the counter. */
    COUNTER.CNTR.R = 1;

