PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
    /* Reset the status bits, including the interrupt flags. */
    COUNTER.STS.R = 0x03ff;

    /* Test only: Enable interrupt on reload. */
    //COUNTER.INTDMA.B.TCF1IE = 1;

#undef COUNTER
#undef DIV_AS_PWR_OF_2
} /* End of initETimer */



/**
 * All ADC conversions are started by the CTU according to the ADC command list it stores
 * in its register file CLR[]. This function fills the command list based on the user
 * configuration.
 */
static void compileAdcCommandList()
{
    /* ADC commands:
       0x8000: CIR, interrupt on done
       0x4000: First command in sequence
       0x2000: 0 for single ADC, 1 for dual conversion
       0x0020: ADC index in single conversion mode
       0x000f: Channel number for ADC 0
       0x0170: Channel number for ADC 1 in dual conversion mode */
    CTU.CLR[0].R = 0x4001;  /* Command 0 - Convert chn1 with ADC 0. */
    CTU.CLR[1].R = 0x000a;  /* Command 1 - Convert chn10 with ADC 0. */
    CTU.CLR[2].R = 0x000f;  /* Command 2 - Convert chn15 with ADC 0. */

    unsigned int idxCmd
               , idxChnAdc0 = 0
               , idxChnAdc1 = 0;
    const unsigned int noCmds = ADC_ADC_0_NO_ACTIVE_CHNS >= ADC_ADC_1_NO_ACTIVE_CHNS
                                ? ADC_ADC_0_NO_ACTIVE_CHNS
                                : ADC_ADC_1_NO_ACTIVE_CHNS
                     , noDualConversions = ADC_ADC_0_NO_ACTIVE_CHNS <= ADC_ADC_1_NO_ACTIVE_CHNS
                                           ? ADC_ADC_0_NO_ACTIVE_CHNS
                                           : ADC_ADC_1_NO_ACTIVE_CHNS
                     , SU = ADC_ADC_0_NO_ACTIVE_CHNS >= ADC_ADC_1_NO_ACTIVE_CHNS? 0: 1;
    _Static_assert(noCmds <= 15, "No more than 15 channels must be configured per ADC unit");
    for(idxCmd=0; idxCmd<noCmds; ++idxCmd)
    {
        /* The warning "-Wtype-limits" is locally switched off. We intentionally permit
           arrays of size zero (no channel configured for single ADC) but this leads to
           never visited code paths. */
        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wtype-limits"

        uint16_t CLR = 0;
        if(idxCmd < noDualConversions)
        {
            /* We begin the command list with dual mode conversions. Both ADC are
               simultaneously converting a channel. */

            assert(idxChnAdc0 < sizeOfAry(adc_adc0_idxEnabledChannelAry)
                   &&  idxChnAdc1 < sizeOfAry(adc_adc1_idxEnabledChannelAry)
                  );
            const unsigned int chnAdc0 = adc_adc0_idxEnabledChannelAry[idxChnAdc0++]
                             , chnAdc1 = adc_adc1_idxEnabledChannelAry[idxChnAdc1++];

            /* Set CMS to dual conversion. */
            CLR |= 0x2000;

            /* Set CH_B, the channel index of ADC_1. */
            CLR |= chnAdc1 << 5;

            /* Set CH_A, the channel index of ADC_0. */
            CLR |= chnAdc0;
        }
        else
        {
            /* One ADC has more active channels than the other. The command list ends with
               a number of single mode conversion commands. */

            unsigned int chnAdc;
            if(SU == 0)
            {
                assert(idxChnAdc0 < sizeOfAry(adc_adc0_idxEnabledChannelAry));
                chnAdc = adc_adc0_idxEnabledChannelAry[idxChnAdc0++];
            }
            else
            {
                assert(idxChnAdc1 < sizeOfAry(adc_adc1_idxEnabledChannelAry));
                chnAdc = adc_adc1_idxEnabledChannelAry[idxChnAdc1++];
            }

            /* ST is set to 0 as it needs to be. */

            /* Set SU, the selection of the ADC unit. */
            CLR |= SU << 5;

            /* Set CH, the channel index of the selected ADC unit. */
            CLR |= chnAdc;

        } /* End if(Is there a conversion still for both ADC units?) */

        #pragma GCC diagnostic pop

        /* The field CIR is not used. The related interrupt is raised on successful
           submission of the command but not after the end of the demanded conversion -
           this interrupt must not be used as an end-of-conversion notification. */

        /* Set FC, the indication of the first command in a sequence. */
        if(idxCmd == 0)
            CLR |= 0x4000;

        /* The field FIFO doesn't care, we fetch the results by ISR from the ADCs
           themselves. We leave it at zero. */

        /* CLR now holds the next command. Write it into the CTU. */
        CTU.CLR[idxCmd].R = CLR;

    } /* for(All conversions required to fulfill the user configuration demands) */

    /* Finalize the list of commands by another, no more executed command with bit FC
       (first bit) set.
         Note, the reference manual is unclear about the use of this bit. The text in
       section 13.5.1 says the bit means whether the command is the first one or not, while
       the register description says the bit marks the last command. However, the register
       description also says that the bit is sometimes referred to as FC instead of LC;
       this may support the "first bit" interpretation. By try and error we found that the
       first bit interpretation is the correct one and so we require a dummy command, which
       is the first command of a subsequent (but never used) sequence. */
    CTU.CLR[idxCmd].R = 0x4000;

} /* End of compileAdcCommandList */



/**
 * Initialization of the CTU. The clock source is connected to the following CTU "program"
 * and triggers its execution regularly:\n
 *   Both ADCs are commanded to do m conversions in parallel, where
 * m=min(#ADC_ADC_0_NO_ACTIVE_CHNS, #ADC_ADC_1_NO_ACTIVE_CHNS), then the last M-m
 * conversions are done by the ADC, which has more active channels, where
 * M=max(#ADC_ADC_0_NO_ACTIVE_CHNS, #ADC_ADC_1_NO_ACTIVE_CHNS).\n
 *   An upper bounds for the duration of the M consecutive conversions is computed and an
 * interrupt is programmed after this time span. Although timer controlled has this
 * interrupt the meaning of an all-conversions-compete notification.
 *   @remark
 * The configuration of the CTU is difficult because there is no explicit start and stop of
 * the core counter. The counter is immediately running and interrupts can occur even
 * before we see the first true trigger (i.e. master reload) of a cycle. Therefore, the
 * configuration does not yet enable the External Interrupts of the CTU. This is done
 * later, when the cyclic processing is explicitly started under control of the
 * application. See adc_startConversions().
 *   @remark
 * The computation of the duration of the sequence of conversions requires the knowledge
 * of the duration of a single conversion. This knowledge is hard-coded in this function but
 * it depends on the configuration of the ADC in initADC(). Other timing settings of the
 * ADC will require maintenance of this function
 */
static void initCTU(void)
{
    /* Enable input */
    CTU.TGSISR.R = 0;
    if(&ETIMER == &ETIMER_0)
    {
        CTU.TGSISR.B.I13_RE = 1; /* The CTU master reload is triggered by each period of the
                                    eTimer_0 generated clock signal. */
    }
    else
        CTU.TGSISR.B.I14_RE = 1; /* Same, but eTimer_1. */

    /* Control register:
         0x0001: 0 for triggered mode
         0x00c0: Prescaler: We use the undevided peripheral clock rate of 120MHz
         0x0100: Enable toggle mode for external trigger output */
    CTU.TGSCR.R = 0x0000;

    /* The first compare register is applied to initiate the sequence of ADC conversions
       immediately after the master reload. */
    CTU.TCR[0].R = 0x0000;

    /* Here, we give an upper bounds of the complete ADC operation of one cycle, including
       a margin. Note, this is an estimation only but the true time is constant (no timing
       variability from cycle to cycle) and rather below; our margin can be small. For
       ADC_T_CYCLE_IN_US being close to the raw conversion time the code here and the
       concept behind will likely fail.
         Note, the computation is based on an hard-coded upper bounds for the single
       conversion. The timing settings of the ADC (see initADC()) yield a conversion time
       of about 2us per channel, rather less. This code requires maintenance when the ADC
       timing is changed in initADC(). */
    #define T_CONV_CYCLE_REGVAL(type)                                                        \
                (type)(0.5 + (2e-6*ADC_NO_CONVERSIONS_PER_CYCLE /* approx conversion time */)\
                             * (float)PERIPHERAL_CLOCK_RATE                                  \
                      )
    _Static_assert( T_CONV_CYCLE_REGVAL(int64_t) > 0  &&  T_CONV_CYCLE_REGVAL(int64_t) < 0xffff
                  , "Internal error, conversion time out of range"
                  );
    _Static_assert( T_CONV_CYCLE_REGVAL(int64_t)
                    + (int64_t)(5e-6 * (float)PERIPHERAL_CLOCK_RATE) /* data fetch in ISR */
                    + (int64_t)(2e-6 * (float)PERIPHERAL_CLOCK_RATE) /* 2us margin */
                    < (int64_t)(ADC_T_CYCLE_IN_US*1e-6 * (float)PERIPHERAL_CLOCK_RATE)
                  , "ADC_T_CYCLE_IN_US is chosen too little for the configured number of ADC"
                    " channels"
                  );

    /* Counter: We let it count fom zero to the implementation maximum. It doesn't matter,
       if the conversion cycle is shorter than counting till the end. */
    CTU.TGSCCR.R = 0xffff;
    CTU.TGSCRR.R = 0x0000;

    /* Enable triggers: The trigger from the first compare register starts the ADC command
       sequence. */
    CTU.THCR1.B.T0_E = 1;    /* Enable trigger 0 */
    CTU.THCR1.B.T0_ADCE = 1; /* and let it start the ADC command sequence. */
#if ENABLE_OUTPUT_OF_CTU_TRIGGER == 1  &&  defined(DEBUG)
    CTU.THCR1.B.T0_ETE = 1;  /* Shortly set external trigger output to 1 on start of
                                conversion */

    /* The use of the external output requires pin configuration. */
    SIU.PCR[46].R = 0x0A04; /* Port C[14] configured as external trigger output of the CTU. */
#endif

    /* All conversions are started by the CTU according to the ADC command list it stores
       in its register file CLR[]. The command list is filled based on the user
       configuration. */
    compileAdcCommandList();

    /* COTR: The length of the impulses in the external trigger output in clock ticks
       impacts their visibility on the scope. */
    CTU.COTR.R = 240; /* 2us at 120 MHz */

    /* Clear all error and interrupt flag bits, if any. */
    CTU.CTUIFR.R = 0x0fff;
    CTU.CTUEFR.R = 0x1fff;

} /* End of initCTU */



/**
 * Initialization of the ADC device.
 *   @param idxAdc
 * One of the two ADC devices ADC_1 or ADC_1 is passed in by index for initialization.
 */
static void initADC(unsigned int idxAdc)
{
    assert(idxAdc <= 1);
    volatile ADC_tag * const pADC = idxAdc == 0? &ADC_0: &ADC_1;
    
    /* Normally, after reset we expect to be in power down mode. To be safe, e.g. after a
       warm start, we wait for it. */
    pADC->MCR.B.PWDN = 1;
    while(pADC->MSR.B.ADCSTATUS != 1)
        ;

    /* Overwrite conversion result if we are too slow to fetch the previous one and report
       this situation. */
    pADC->MCR.B.OWREN = 1;

    /* Have left aligned result: This makes code more portable, scaling becomes independent
       of actual ADC resolution. */
    pADC->MCR.B.WLSIDE = 1;

