PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
    /* Use the single shot mode. */
    pADC->MCR.B.MODE = 0;

    /* Reference voltage selection: On the TRK-USB board both reference voltage inputs are
       connected to the 3.3V supply. We cannot choose for the 5V reference.
         Note, while documented in the reference manual of the MCU (section 8.3.2.1, p.143)
       is the bit not defined in the MCU header file and nor shown by the debugger. We
       can't access it by name. */
    if((idxAdc == 0? ADC_ADC_0_REF_VOLTAGE: ADC_ADC_1_REF_VOLTAGE) >= (3.6f + 4.5f)/2.0f)
        pADC->MCR.R |= 0x80000u;
    else
        pADC->MCR.R &= ~0x80000u;
    
    /* Enable the cross trigger unit (CTU) for timing control. */
    pADC->MCR.B.CTUEN = 1;

    /* Use the slower out of two possible clock rates. Maximum speed of conversion is not a
       matter for this driver. Slower speed will generally be better for accuracy. */
    pADC->MCR.B.ADCLKSEL = 0;

    /* No interrupts are enabled. The end of the conversions is signalled by the CTU. */
    pADC->IMR.R = 0;
    pADC->CIMR0.R = 0;

    /* Don't use DMA. */
    pADC->DMAE.B.DMAEN = 0;

    /* Timing of conversion. We use a slow timing for this driver.
         Sample time is (INSAMP-1)/60e6 [s].
         OFFSHIFT: Symmetric rounding.
         Note, any change of the timing requires consistent maintenance on the other
       function initCTU(). See there for details. */
    pADC->CTR0.B.INPLATCH = 1;
    pADC->CTR0.B.OFFSHIFT = 1;
    pADC->CTR0.B.INPCMP = 0;
    pADC->CTR0.B.INSAMP = 61 /* 1us */;

    /* Channels 10 and 15 use a separate register. Here, bit 0 of INSAMP has an impact on
       the timing but holds the value of TSENSOR_SEL at the same time. This makes the bit
       effectively unusable if the temperature sensor is read out.
         Caution, the modelling of the doubly used bit is wrong in the MCU header: The
       header defines only seven bits of INPSAMP as "INSAMP" while the 8th bit is
       separately defined as TSENSOR_SEL. The value of INPSAMP will be too large by factor
       2 if naively set through "INSAMP".
         Note, OFFSHIFT is not available for channels 10 and 15. */
    pADC->CTR1.B.INPLATCH = 1;
    pADC->CTR1.B.INPCMP = 0;
    pADC->CTR1.B.INSAMP = 61 /* 1us */ / 2;
#if ADC_USE_ADC_0_CHANNEL_15 == 1  ||  ADC_USE_ADC_1_CHANNEL_15 == 1
    _TSENSOR_SEL = 0;
    pADC->CTR1.B.TSENSOR_SEL = _TSENSOR_SEL;
#else
    pADC->CTR1.B.TSENSOR_SEL = 0;
#endif

    /* Selection of channels, pADC->NCMR0.R: Out of scope, the channel selection is
       commanded by the CTU and there configured. */

    /* The end of conversion interrupt is configured. We generally enable the end-of-CTU
       interrupts but limit this to the very channel in the very ADC, which is the last
       conversion of the cycle.
         Note, this will work only under the presumption, that both ADCs operate perfectly
       synchronously and end in the same clock tick; if the last conversion is a dual
       conversion then we need to arbitrarily choose one of both ADCs as interrupt source. */
#if ADC_ADC_0_NO_ACTIVE_CHNS >= ADC_ADC_1_NO_ACTIVE_CHNS
    const unsigned int idxAdcWithEOCTUIrq = 0
                     , idxLastChn = adc_adc0_idxEnabledChannelAry[ADC_ADC_0_NO_ACTIVE_CHNS-1];
#else
    const unsigned int idxAdcWithEOCTUIrq = 1
                     , idxLastChn = adc_adc1_idxEnabledChannelAry[ADC_ADC_1_NO_ACTIVE_CHNS-1];
#endif
    if(idxAdc == idxAdcWithEOCTUIrq)
    {
        /* Enable channel interrupts only for last channel in conversion cycle. */
        pADC->CIMR0.R = 0x1u << idxLastChn;
        
        /* Reset all possibly pending interrupt bits. */
        pADC->CEOCFR0.R = 0x0000fffful;
        
        /* Generally enable the end of CTU conversion interrupts and disable all others. */
        pADC->IMR.R = 0x00000010ul;
        
    } /* End if(Function is called for ADC with longer list of conversions to do) */

    /* Leave power down mode, goto operation. */
    pADC->MCR.B.PWDN = 0;
    while(pADC->MSR.B.ADCSTATUS != 0)
        ;

} /* End of initADC */


/**
 * The end-of-conversion interrupt handler. This interrupt is notified by the ADC unit,
 * which has more conversions to do. The first conversions of a cycle, as long as both
 * units still have to convert enabled channels, are commanded by the CTU in dual mode. If
 * one unit has more conversion then these are appended in single mode. If the last
 * conversion is done in dual mode than unit ADC_0 notifies the interrupt. In either case
 * is this the EOCTU interrupt of the last converted channel in the cycle.\n
 *   The ISR checks the status of the active ADC units (register MSR). The results are
 * marked good only if both ADCs are idle and signal the completion of all channels. In
 * this case all enabled channel conversion results are fetched from the registers CDRn.
 * These registers contain further validity information dedicated to the channel. The API
 * data is updated with the new conversion result only if this validity information is as
 * expected. Otherwise the overall validity of the conversion cycle is set to bad.\n
 *   Since we maintain only a single validity information for the entire conversion cycle
 * it may happen that this indicates bad although single channels have been found good and
 * have been updated in the API. However, it'll not happen that any channel is found bad
 * while the cycle related validity says good. The summarized validity information is
 * justified by the very low likelihood of ever seeing a bad result (once the configuration
 * is proven to work well).
 *   @remark 
 * See https://community.nxp.com/message/978486 for a discussion of possible interrupt
 * sources for the given purpose.
 */
static void isrAdcAllConversionsDone(void)
{
#if ADC_ADC_0_NO_ACTIVE_CHNS >= ADC_ADC_1_NO_ACTIVE_CHNS
    volatile ADC_tag * const pADC = &ADC_0;
#else
    volatile ADC_tag * const pADC = &ADC_1;
#endif

    /* Check status of the ADCs. We expect the bit CTUSTART to be set and the reference
       voltage range bit depending on the configured reference voltage, but most other bits
       reset, indicating the idle/ready state.
         Note, we maintain a single success status for all ADCs and all channels together,
       although we have ADC specific and even channel specific information. We could
       provide success information on a per channel base. Not doing so is justified by the
       very low likelihood of ever seeing a problem. In this very rare case we are still on
       the safe side - we don't use a bad result but only loose some maybe still alright
       results. */
    bool success =
#if ADC_ADC_0_NO_ACTIVE_CHNS > 0
        (((ADC_0.MSR.R) ^ (0x10000u | ADC_0_BIT_REF_RANGE)) & 0x019d0027u) == 0
        &&  ADC_0.CEOCFR0.R == ADC_ADC_0_CHANNEL_BIT_MASK
#endif
#if ADC_ADC_0_NO_ACTIVE_CHNS > 0  &&  ADC_ADC_1_NO_ACTIVE_CHNS > 0
        &&
#endif
#if ADC_ADC_1_NO_ACTIVE_CHNS > 0
        (((ADC_1.MSR.R) ^ (0x10000u | ADC_0_BIT_REF_RANGE)) & 0x019d0027u) == 0
        &&  ADC_1.CEOCFR0.R == ADC_ADC_1_CHANNEL_BIT_MASK
#endif
        ;

    if(success)
    {
        _Static_assert( sizeOfAry(_conversionResAry) == sizeOfAry(adc_pCDRAry)
                      , "Internal implementation error"
                      );
        unsigned int idxChn;
        const volatile uint32_t * const *ppCDR = &adc_pCDRAry[0];
        uint16_t *pConvRes = &_conversionResAry[0];
        for(idxChn=0; idxChn<ADC_NO_ACTIVE_CHNS; ++idxChn)
        {
            const uint32_t CDR = ** ppCDR++;
            if((CDR & 0x000f0000) == 0x000a0000)
                * pConvRes++ = (uint16_t)(CDR & 0x0000ffff);
            else
                success = false;
        }        
        
        if(success)
        {
            /* Channel 10 is hardwired to the internal reference voltage source VREG_1.2V.
               We store the averaged reading of this channel, know the nominal voltage and
               can thus compute a calibration factor. This factor is then applied to all
               the channels of the given ADC.
                 Nominal voltage: The signal name says 1.2 V but we have measured 1.24 V at
               two real devices and literature mostly says around 1.25 V for a bandgap
               reference. Moreover, most purchasable reference voltage products have a
               nominal voltage of 1.24 V. This value is what we use. */
# if ADC_USE_ADC_0_CHANNEL_10 == 1  ||  ADC_USE_ADC_1_CHANNEL_10 == 1
            _Static_assert( ADC_FILTER_COEF_VREG_1_2V >= 0.0f
                            &&  ADC_FILTER_COEF_VREG_1_2V < 1.0f
                          , "Bad filter constant configured for smoothing VREG_1.2V"
                          );
#endif
# if ADC_USE_ADC_0_CHANNEL_10 == 1
            _adc0_chn10 = _adc0_chn10 * ADC_FILTER_COEF_VREG_1_2V
                          + (1.0f - ADC_FILTER_COEF_VREG_1_2V) / 1.24f
                            * (float)_conversionResAry[adc_adc0_idxChn10];

# endif
# if ADC_USE_ADC_1_CHANNEL_10 == 1
            _adc1_chn10 = _adc1_chn10 * ADC_FILTER_COEF_VREG_1_2V
                          + (1.0f - ADC_FILTER_COEF_VREG_1_2V) / 1.24f
                            * (float)_conversionResAry[adc_adc1_idxChn10];
# endif

