PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
            /* The reading of the TSENS channels is averaged with a simple first order low
               pass. */
# if ADC_USE_ADC_0_CHANNEL_15 == 1  ||  ADC_USE_ADC_1_CHANNEL_15 == 1
            _Static_assert( ADC_FILTER_COEF_TSENS >= 0.0f  &&  ADC_FILTER_COEF_TSENS < 1.0f
                          , "Bad filter constant configured for smoothing TSENS"
                          );
            assert((_TSENSOR_SEL & ~0x1u) == 0);
#endif
# if ADC_USE_ADC_0_CHANNEL_15 == 1
            _TSENS_0[_TSENSOR_SEL] = _TSENS_0[_TSENSOR_SEL] * ADC_FILTER_COEF_TSENS
                                    + (1.0f - ADC_FILTER_COEF_TSENS)
                                      * (float)_conversionResAry[adc_adc0_idxChn15];
#endif
# if ADC_USE_ADC_1_CHANNEL_15 == 1
            _TSENS_1[_TSENSOR_SEL] = _TSENS_1[_TSENSOR_SEL] * ADC_FILTER_COEF_TSENS
                                    + (1.0f - ADC_FILTER_COEF_TSENS)
                                      * (float)_conversionResAry[adc_adc1_idxChn15];
#endif
# if ADC_USE_ADC_0_CHANNEL_15 == 1  ||  ADC_USE_ADC_1_CHANNEL_15 == 1
            _TSENSOR_SEL = (_TSENSOR_SEL+1) & 0x1;
# endif
# if ADC_USE_ADC_0_CHANNEL_15 == 1
            ADC_0.CTR1.B.TSENSOR_SEL = _TSENSOR_SEL;
# endif
# if ADC_USE_ADC_1_CHANNEL_15 == 1
            ADC_1.CTR1.B.TSENSOR_SEL = _TSENSOR_SEL;
# endif
        } /* End if(Processing of data of channels 10 and 15 possible?) */
    } /* End if(MSR shows idle state of ADC?) */


    /* Diagnosis: Keep track of ever failed conversions (debugging) and provide a measure
       how long it is ago that we could successfully sample all channels. */
    if(success)
        _ageOfConversionResults = 0;
    else
    {
        unsigned int noFailedConversions = _noFailedConversions + 1;
        if(noFailedConversions != 0)
            _noFailedConversions = noFailedConversions;
        
        unsigned short ageOfConversionResults = _ageOfConversionResults + 1;
        if(ageOfConversionResults != 0)
            _ageOfConversionResults = ageOfConversionResults;
    }
    
    /* Call the user's notification function - if any. */
    if(_cbEndOfConversion != NULL)
        (*_cbEndOfConversion)();

    /* Clear the channel related EOC interrupt flag to be ready for the next conversion
       cycle. The interrupt is enabled for only one channel (the last one in the cycle) but
       we clear all other channels, too, to stay able to do the validity test on next entry
       into this ISR again. */
#if defined(DEBUG) &&  ADC_ADC_0_NO_ACTIVE_CHNS >= ADC_ADC_1_NO_ACTIVE_CHNS
    ADC_1.CEOCFR0.R = 0x0000fffful;
#else
    ADC_0.CEOCFR0.R = 0x0000fffful;
#endif
    pADC->CEOCFR0.R = 0x0000fffful;
    
    /* Clear the general interrupt flag in register ISR. We except to serve an end-of-CTU
       interrupt. This assertion would e.g. fire if the reference voltage is not found as
       expected. */
    assert(pADC->ISR.R == 0x00000010ul);
    pADC->ISR.R = 0x00000010ul;

} /* End of isrAdcAllConversionsDone */



/**
 * Initialization of ADC driver. This function needs to be called before use of any of the
 * other functions offered by this driver.\n
 *   Note, most settings of the driver are either hard-coded (e.g. conversion timing) or
 * made by compile-time configuration switches (preprocessor macros). Particularly, the set
 * of channels to convert are made in the latter way. It is not possible to select specific
 * ADC channels at run-time.\n
 *   The configuration and initialization only relates to ADC channels but not to MCU pins.
 * The routing of signals from external accessible MCU pins to the ADC channel inputs needs
 * to be one by the client code (see SIUL programming in the MCU reference manual),
 * otherwise the ADC readings will stay arbitrary with the few exceptions of converting
 * internal signals.\n
 *   Note, SIUL pin configuration is done by this function for the one or two output
 * signals, which can be routed to MCU pins for development support and debugging purpose
 * (and in DEBUG compilation only). See #ENABLE_OUTPUT_OF_ETIMER_CHN2 and
 * #ENABLE_OUTPUT_OF_CTU_TRIGGER for more.
 *   @param priorityOfIRQ
 * The priority of the end-of-conversion interrupt. The range is 1..15, it is a priority as
 * handled by the INTC (see MCU reference manual, section 28, p. 911).\n
 *   Note, this priority has direct impact on your callback \a cbEndOfConversion: It is run
 * from the same interrupt context.
 *   @param cbEndOfConversion
 * A callback can be passed to the driver which is invoked from the context of the
 * end-of-conversion interrupt every time a new set of conversion result has been read from
 * the ADCs. Pass NULL if not required.
 *   @remark
 * This function must be called once and only once at system startup time. Reconfiguration
 * of the driver is not supported.
 *   @remark
 * If channel 15 of one or both ADCs is enabled for conversion, i.e. if the internal chip
 * temperature sensors are configured for use, then the driver depends on the availability
 * of the test and calibration data and the initialization of module \a mcuTestAndCalData
 * needs to be done prior to the initialization of the ADC driver. See
 * tac_initTestAndCalibrationDataAry() for details.
 */
void adc_initDriver(unsigned int priorityOfIRQ, void (*cbEndOfConversion)(void))
{
    _Static_assert( ADC_ADC_0_REF_VOLTAGE >= 3.0f  &&  ADC_ADC_0_REF_VOLTAGE <= 5.5f
                    &&  ADC_ADC_1_REF_VOLTAGE >= 3.0f  &&  ADC_ADC_1_REF_VOLTAGE <= 5.5f
                  , "Reference voltage out of range"
                  );
    _Static_assert( adc_adc0_noActiveChns == ADC_ADC_0_NO_ACTIVE_CHNS
                    &&  adc_adc1_noActiveChns == ADC_ADC_1_NO_ACTIVE_CHNS
                  , "Internal error, inconsistencies in configuration data"
                  );
    assert(_cbEndOfConversion == NULL);
    _cbEndOfConversion = cbEndOfConversion;

    initETimer();
    initCTU();
#if ADC_ADC_0_NO_ACTIVE_CHNS > 0
    initADC(/* idxAdc */ 0);
#endif
#if ADC_ADC_1_NO_ACTIVE_CHNS > 0
    initADC(/* idxAdc */ 1);
#endif

    /* The ADC width the most enabled conversions per cycle is programmed to raise an
       interrupt on completion of the last ADC command from the CTU. Install service
       routine. */
#if ADC_ADC_0_NO_ACTIVE_CHNS >= ADC_ADC_1_NO_ACTIVE_CHNS
    const unsigned int vectorNumAdcEOC = 62; /* ADC_0 */
#else
    const unsigned int vectorNumAdcEOC = 82; /* ADC_1 */
#endif
    assert(priorityOfIRQ > 0  &&  priorityOfIRQ <= 15);
    ihw_installINTCInterruptHandler( isrAdcAllConversionsDone
                                   , vectorNumAdcEOC
                                   , /* psrPriority */ priorityOfIRQ
                                   , /* isPreemptable */ true
                                   );
                                  
