PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
    /* Prepare the constants for the computation of the chip temperature. */
#if ADC_USE_ADC_0_CHANNEL_15 == 1
    TSENS_0_P1 = (signed long)(tac_mcuTestAndCalibrationDataAry[4] & 0x0fff);
    TSENS_0_P2 = (signed long)(tac_mcuTestAndCalibrationDataAry[0] & 0x0fff);
    TSENS_0_C1 = (signed long)(tac_mcuTestAndCalibrationDataAry[5] & 0x0fff);
    TSENS_0_C2 = (signed long)(tac_mcuTestAndCalibrationDataAry[1] & 0x0fff);
#endif
#if ADC_USE_ADC_1_CHANNEL_15 == 1
    TSENS_1_P1 = (signed long)(tac_mcuTestAndCalibrationDataAry[6] & 0x0fff);
    TSENS_1_P2 = (signed long)(tac_mcuTestAndCalibrationDataAry[2] & 0x0fff);
    TSENS_1_C1 = (signed long)(tac_mcuTestAndCalibrationDataAry[7] & 0x0fff);
    TSENS_1_C2 = (signed long)(tac_mcuTestAndCalibrationDataAry[3] & 0x0fff);
#endif
} /* End of adc_initDriver */



/**
 * After driver initialization everything is configured but the main clock, the eTimer
 * counter, is not running. This function starts the timer and the first conversion is
 * immediately initiated.\n
 *   The intention is to use this function once after all I/O initialization, when all ISRs
 * are registered and immediately after the External Interrupt processing by the CPU is
 * enabled. Regular data processing starts.
 */
void adc_startConversions()
{
     /* Enable general reload and TGS input selection reload. By experience, this sets all
        the trigger interrupt flags and some of the error bits. We have to clear them
        before we can safely enable interrupt handling.
          A memory barrier is applied to make all changes take effect before we enter the
        code to "repair" the unwanted artifacts. */
    CTU.CTUCR.R = 0xff87;
    atomic_thread_fence(memory_order_seq_cst);
    CTU.CTUIFR.R = 0x0fff;
    CTU.CTUEFR.R = 0x1fff;

    /* Start the timer channel we are working with. */
    ETIMER.ENBL.R |= (1<<TIMER_CHN);

} /* End of adc_startConversions */




/** 
 * The channel result of a conversion cycle is updated only if no error has been detected
 * for that channel in the given cycle. If at least one channel result from a cycle has
 * not been updated due to a recognized problem then the age of the conversion results is
 * incremented. As long as no conversion problem appears, the returned age is always zero
 * and all channel results are up-to-date. A non zero value indicates how long it is ago
 * that a fully correct conversion cycle has been completed. The unit of this time is the
 * period of the regular conversion cycles, see #ADC_T_CYCLE_IN_US.
 *   Note, because a single age is used to all channels of the conversion cycle there may
 * be single results in the cycle, which are actually more recent as the returned age says.
 *   The use of a common age for all enabled ADC channels has been decided because of the
 * very low likelihood of a recognized conversion error.
 *   @return
 * Get the age of the conversion results in the unit #ADC_T_CYCLE_IN_US. Should normally
 * zero if no problem is apparent.\n
 *   The value is saturated at its implementation maximum. The same vale is returned after
 * driver initialization and before the first conversion result is available.
 *   @remark
 * Coherent reading of ADC channel result(s) and the age of the conversion result is
 * subject to the design of the client code. If coherence is an issue then it needs to
 * implement a critical section, which contains the retrieval of all channel results and
 * their (common) age or it can use the end-of-conversion notification callback to read the
 * required results race condition free in sync with the conversion cycle.
 */
unsigned short adc_getChannelAge()
{
    return _ageOfConversionResults;

} /* End of adc_getChannelAge */



/**
 * Get the last recent non calibrated conversion result for a single channel. (See
 * adc_getChannelVoltage() and adc_getChannelVoltageAbdAge() for getting calibrated
 * results.)
 *   @return
 * Get the conversion result in as ADC counts as read from the ADC register. The scaling is
 * linear, zero means zero and 0x10000 means input voltage is same as reference voltage
 * supplied to the MCU. (3.3 V in case of the TRK-UBS-MPC5643L.)
 *   @param idxChn
 * The index of the channel to be read. Note, this index doesn't relate to the sixteen ADC
 * channels available in hardware but to the set of user configured channels. A
 * configuration dependent enumeration is offered for that.
 *   @remark
 * Coherent reading of several ADC channels or of a channel and the age of the conversion
 * result is subject to the design of the client code. If the conversion results, that are
 * fetched for more than one channel, need to be acquired in one and the same conversion
 * cycle then the client code can implement a critical section, which contains the
 * necessary number of calls of this function or it can use the end-of-conversion
 * notification callback to read the required results race condition free in sync with the
 * conversion cycle.
 *   @remark
 * Using this function for channel 15 of either ADC_0 or ADC_1 is rather useless. This
 * channel is alternatingly connected to two (internal) voltage sources for measuring the
 * internal chip temperature. If using this function it is undefined which one of both is
 * fetched. Only use adc_getTsens0() or adc_getTsens1() to directly read the temperature.
 */
uint16_t adc_getChannelRawValue(adc_idxEnabledChannel_t idxChn)
{
    assert((unsigned)idxChn < sizeOfAry(_conversionResAry));
    return _conversionResAry[(unsigned)idxChn];

} /* End of adc_getChannelRawValue */



/**
 * Get the last recent conversion result for a single channel.
 *   @return
 * Get the conversion result in Volt. The calibration of the reading of an ADC counter
 * register can be based either directly on the nominal reference voltage
 * #ADC_ADC_0_REF_VOLTAGE or #ADC_ADC_1_REF_VOLTAGE or on the filtered readings of the
 * internal reference voltage source VREG_1.2V. Which one applies depends on
 * #ADC_USE_ADC_0_CHANNEL_10 and #ADC_USE_ADC_1_CHANNEL_10.\n
 *   See adc_getChannelRawValue() for getting non calibrated raw ADC counts as conversion
 * result.
 *   @param idxChn
 * The index of the channel to be read. Note, this index doesn't relate to the sixteen ADC
 * channels available in hardware but to the set of user configured channels. A
 * configuration dependent enumeration is offered for that.
 *   @remark
 * Coherent reading of several ADC channels is subject to the design of the client code. If
 * the conversion results for more than one channel need to be acquired in one and the same
 * conversion cycle then the client code can implement a critical section, which contains
 * the necessary number of calls of this function or it can use the end-of-conversion
 * notification callback to read the required results race condition free in sync with the
 * conversion cycle.
 *   @remark
 * The coherent reading of several channel values and validity (using adc_getChannelAge()) is
 * subject to the design of the client code. For a single channel the dedicated function
 * adc_getChannelVoltageAndAge() is offered.
 *   @remark
 * Using this function for channel 15 of either ADC_0 or ADC_1 is rather useless. This
 * channel is alternatingly connected to two (internal) voltage sources for measuring the
 * internal chip temperature. If using this function it is undefined which one of both is
 * fetched. Only use adc_getTsens0() or adc_getTsens1() to directly read the temperature.
 */
float adc_getChannelVoltage(adc_idxEnabledChannel_t idxChn)
{
    /* If channel 10 of an ADC is activate by configuration: The reference voltage for all
       channels of this ADC is the averaged and scaled reading of the internal band gap
       reference voltage source VREG_1.2V.
         Otherwise: The reference voltage is the nominal external reference voltage supplied
       to both the ADCs. */
    float R;
    if(idxChn < ADC_ADC_0_NO_ACTIVE_CHNS)
    {
#if ADC_USE_ADC_0_CHANNEL_10 == 1
        R = 1.0f / _adc0_chn10;
#else
        R = ((float)ADC_ADC_0_REF_VOLTAGE / 65536.0f);
#endif
    }
    else
    {
#if ADC_USE_ADC_1_CHANNEL_10 == 1
        R = 1.0f / _adc1_chn10;
#else
        R = ((float)ADC_ADC_1_REF_VOLTAGE / 65536.0f);
#endif
    }
    
    assert((unsigned)idxChn < sizeOfAry(_conversionResAry));
    return R * (float)_conversionResAry[(unsigned)idxChn];
    
} /* End of adc_getChannelVoltage */




/**
 * Get the last recent conversion result for a single channel together with the coherently
 * read validity information.
 *   @return
 * Get the conversion result in Volt. The calibration of the reading of an ADC counter
 * register can be based either directly on the nominal reference voltage
 * #ADC_ADC_0_REF_VOLTAGE or #ADC_ADC_1_REF_VOLTAGE or on the filtered readings of the
 * internal reference voltage source VREG_1.2V. Which one applies depends on
 * #ADC_USE_ADC_0_CHANNEL_10 and #ADC_USE_ADC_1_CHANNEL_10.\n
 *   See adc_getChannelRawValue() for getting non calibrated raw ADC counts as conversion
 * result.
 *   @param pAge
 * The "age" of the result can be read coherently with the result itself. The unit of the
 * returned value is the duration of one conversion cycle, see #ADC_T_CYCLE_IN_US.\n
 *   If the data fetching task runs synchronously with the conversion cycle then this
 * value would always be zero as long as no conversions fail. Otherwise the value would
 * indicate how many cycles ago the returned conversion result has been acquired.
 *   @param idxChn
 * The index of the channel to be read. Note, this index doesn't relate to the sixteen ADC
 * channels available in hardware but to the set of user configured channels. A
 * configuration dependent enumeration is offered for that.
 *   @remark
 * Coherent reading of several ADC channels is subject to the design of the client code. If
 * the conversion results for more than one channel need to be acquired in one and the same
 * conversion cycle then the client code can implement a critical section, which contains
 * the necessary number of calls of this function or it can use the end-of-conversion
 * notification callback to read the required results race condition free in sync with the
 * conversion cycle.
 *   Note that the validity information * \a pAge is identical for all channel results of
 * one and the same conversion cycle. Therefore and because this function requires a
 * critical section for each invocation, it is more performant to use
 * adc_getChannelVoltage() repeatedly and adc_getChannelAge() once if the client code
 * implements a critical section to read more than one channel coherently.
 *   @remark
 * The coherent reading of value and age requires some implementation of a critical
 * section. This is necessarily code that depends on the environment, which this driver is
 * integrated in. We use the implementation from the startup code of the TRK-USB-MPC5643L
 * project. The integration of this driver is generally possible into other environments
 * but this function will require adaptations.
 *   @remark
 * Using this function for channel 15 of either ADC_0 or ADC_1 is rather useless. This
 * channel is alternatingly connected to two (internal) voltage sources for measuring the
 * internal chip temperature. If using this function it is undefined which one of both is
 * fetched. Only use adc_getTsens0() or adc_getTsens1() to directly read the temperature.
 */
float adc_getChannelVoltageAndAge(unsigned short *pAge, adc_idxEnabledChannel_t idxChn)
{
    assert((unsigned)idxChn < sizeOfAry(_conversionResAry));
    
