PeterVranken/TRK-USB-MPC5643L/LSM/ADC/code/ADC/adc_eTimerClockedAdc.c
    uint16_t adcCnt;
    uint32_t msr = ihw_enterCriticalSection();
    {
        adcCnt = _conversionResAry[(unsigned)idxChn];
        *pAge = _ageOfConversionResults;
    }
    ihw_leaveCriticalSection(msr);
    
    /* If channel 10 of an ADC is activate by configuration: The reference voltage for all
       channels of this ADC is the averaged and scaled reading of the internal band gap
       reference voltage source VREG_1.2V.
         Otherwise: The reference voltage is the nominal external reference voltage supplied
       to both the ADCs. */
    float R;
    if(idxChn < ADC_ADC_0_NO_ACTIVE_CHNS)
    {
#if ADC_USE_ADC_0_CHANNEL_10 == 1
        R = 1.0f / _adc0_chn10;
#else
        R = ((float)ADC_ADC_0_REF_VOLTAGE / 65536.0f);
#endif
    }
    else
    {
#if ADC_USE_ADC_1_CHANNEL_10 == 1
        R = 1.0f / _adc1_chn10;
#else
        R = ((float)ADC_ADC_1_REF_VOLTAGE / 65536.0f);
#endif
    }
    
    return R * (float)adcCnt;
    
} /* End of adc_getChannelVoltageAndAge */




#if ADC_USE_ADC_0_CHANNEL_15 == 1
/**
 * Get the current chip temperature TSENS_0.
 *   @return
 * Get the temperature in degrees centigrade.
 */
float adc_getTsens0(void)
{
    /* TSENS temperature calculation. */
    const float A = _TSENS_0[0]*TSENS_0_C2 - TSENS_0_P2*_TSENS_0[1]
              , B = _TSENS_0[1]*TSENS_0_P1 - _TSENS_0[0]*TSENS_0_C1;

    return (float)TSENS_T2 + ((float)(TSENS_T1-TSENS_T2)*A)/(float)(A+B);

} /* End of adc_getTsens0 */
#endif


#if ADC_USE_ADC_1_CHANNEL_15 == 1
/**
 * Get the current chip temperature TSENS_1.
 *   @return
 * Get the temperature in degrees centigrade.
 */
float adc_getTsens1(void)
{
    /* TSENS temperature calculation. */
    const float A = _TSENS_1[0]*TSENS_1_C2 - TSENS_1_P2*_TSENS_1[1]
              , B = _TSENS_1[1]*TSENS_1_P1 - _TSENS_1[0]*TSENS_1_C1;

    return (float)TSENS_T2 + ((float)(TSENS_T1-TSENS_T2)*A)/(float)(A+B);

} /* End of adc_getTsens1 */
#endif


